In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.2'

In [21]:
s1=pd.Series(['navy','red','dark blue','yellow','sandle'],index=[1,2,3,4,5])

In [22]:
s1

1         navy
2          red
3    dark blue
4       yellow
5       sandle
dtype: object

In [23]:
s2=pd.Series(['pencil','fire','sky','ball','shirt'],index=[1,2,3,4,5])

In [24]:
s2

1    pencil
2      fire
3       sky
4      ball
5     shirt
dtype: object

In [25]:
df1=pd.DataFrame(s1,columns=["colour"])

In [26]:
df1

      colour
1       navy
2        red
3  dark blue
4     yellow
5     sandle

In [27]:
df1["object"]=s2

In [28]:
df1

      colour  object
1       navy  pencil
2        red    fire
3  dark blue     sky
4     yellow    ball
5     sandle   shirt

In [29]:
animal={"domesticated":{1:"dog",2:"cat",3:"pig",4:"goat"},"wild":{1:"wolf",2:"lion",3:"wild boar",4:"wild goat"}}

In [31]:
df2=pd.DataFrame(animal,columns=["domesticated","wild"])

In [32]:
df2

  domesticated       wild
1          dog       wolf
2          cat       lion
3          pig  wild boar
4         goat  wild goat

Activity 1

create a dataframe for your class, containing 'name','regno.','year of study' as column names for 5 students

In [34]:
Class={"name":{1:"bea",2:"cathy",3:"danial",4:"fiona",5:"gerry"},
       "reg no.":{1:1226801,2:1128802,3:1228903,4:1218804,5:1129805},
       "year of study":{1:"3rd",2:"3rd",3:"3rd",4:"3rd",5:"3rd"}}

In [35]:
df3=pd.DataFrame(Class,columns=["name","reg no.","year of study"])

In [36]:
df3

     name  reg no. year of study
1     bea  1226801           3rd
2   cathy  1128802           3rd
3  danial  1228903           3rd
4   fiona  1218804           3rd
5   gerry  1129805           3rd

In [37]:
name=df3["name"]

In [38]:
name

1       bea
2     cathy
3    danial
4     fiona
5     gerry
Name: name, dtype: object

In [39]:
df2.drop(4,axis=0)

  domesticated       wild
1          dog       wolf
2          cat       lion
3          pig  wild boar

In [40]:
df2.drop("domesticated",axis=1)

        wild
1       wolf
2       lion
3  wild boar
4  wild goat